CompSci/flexsystems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Gerald Jay Sussman on Flexible Systems</title>
<!-- 2016-01-23 Sat 14:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Gerald Jay Sussman on Flexible Systems</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Some Notes</a>
<ul>
<li><a href="#sec-2-1">Side note: There is danger in floating points:</a></li>
</ul>
</li>
<li><a href="#sec-3">Extensible Generics - My Ball of Mud</a></li>
<li><a href="#sec-4">Propagation Model</a></li>
<li><a href="#sec-5">Further Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
These are some notes on a lecture by Gerald Jay Sussman on Flexible
Systems and the power of Generic Systems. The video can be found
<a href="http://vimeo.com/151465912">here</a>.
</p>

<p>
Sussman is one of the authors of The Structure and Interpretation of
Computer Programs, which I have mentioned in my Library section. He
has been programming since 1952.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Some Notes</h2>
<div class="outline-text-2" id="text-2">
<p>
One  of the biggest problems is writing programs that are dead
ends - the world changes and you have to change massive parts of
it. The genome is an example of the opposite at about 1Gb. Something
is very wrong with the way we program. 
</p>

<p>
Flexibility is the key thing we need to optimise, correctness is
generally not the issue.
</p>

<p>
Acceptable behaviour over a much larger class of situations than was
anticipated by its designer.
</p>

<p>
He uses a "body plan" example to show a genericity amongst animals
and radio receivers.
</p>

<p>
A diamond is very pretty but very hard to add to, mud is not so
pretty, but you can always add more mud to a ball of mud.
</p>

<p>
He creates an example of evolving a solution for integrating a
simple equation and shows how it can be made more flexible and
modified for symbolic calculations.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Side note: There is danger in floating points:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
$$\frac{996 \times 10^0 + 998 \times 10^0}{2} \Longrightarrow 995 \times 10^0$$
</p>

<p>
Using sticky notes to control applicability, using an annotate
function. These can be used for dispatching in composable functions.
</p>

<p>
I don't want to spend time fixing code that is already built. Emacs
is the inspiration. 10,000 people have contributed and it is just as
stable.
</p>

<p>
The people who believe that an autopilot should be perfect are
wrong. It should work perfectly when everything is going well,
otherwise it turns itself off. It should not, it should try and do
something reasonable. A lot of problems are due to a blame culture
and the way the legal system is organised.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Extensible Generics - My Ball of Mud</h2>
<div class="outline-text-2" id="text-3">
<p>
I want to be able to do this:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span class="linenr"> 1: </span>(<span style="color: #859900;">define</span> <span style="color: #268bd2;">foo</span> (make-generic-operation 'foo 2))
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span>(add-to-generic-opration! foo
<span class="linenr"> 4: </span>                          (all-args 2 number?)
<span class="linenr"> 5: </span>                          (<span style="color: #859900;">lambda</span> (a b) (+ a b)))
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>(add-to-generic-opration! foo
<span class="linenr"> 8: </span>                          (any-arg 2 symbol? number?)
<span class="linenr"> 9: </span>                          (<span style="color: #859900;">lambda</span> (a b) (list '+ a b)))
<span class="linenr">10: </span>
<span class="linenr">11: </span>(foo 1 2)
<span class="linenr">12: </span><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">=&gt; 3</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span>(foo 1 'a)
<span class="linenr">15: </span><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">=&gt; (+ 1 a)</span>
</pre>
</div>

<p>
Making a generic arithmetic and we get stuff like:
</p>

<div class="org-src-container">

<pre class="src src-scheme"><span class="linenr">16: </span>(+ 1 'a 3)
<span class="linenr">17: </span><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">=&gt; (+ (+ 1 a) 3)</span>
<span class="linenr">18: </span>
<span class="linenr">19: </span>(+ 'a ((+ cos sin) 3))
<span class="linenr">20: </span><span style="color: #586e75; font-style: italic;">;; </span><span style="color: #586e75; font-style: italic;">=&gt; (+ a -.8488724)</span>
</pre>
</div>

<p>
Building degeneracy into our software is a way of doing things
multiple ways to get the same results. That way if some method
fails, another method can be used. It is not something we often do.
</p>

<p>
The best solutions are ones that work in situations we didn't expect
they would.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Propagation Model</h2>
<div class="outline-text-2" id="text-4">
<p>
A brief aside into a plumbing model.
</p>

<p>
In the propagation model, machines are connected to cells which hold
the knowledge of a single piece of information about the fact. The
cells merge the information and the machines read and write the
information. Providence of information is also carried by the cells.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Further Notes</h2>
<div class="outline-text-2" id="text-5">
<p>
A lot of the code is described as careful but dangerous programming,
but the trade off is worth it and the mechanism can be robust like
biological systems. Sometimes things do have to be proved, for
example a garbage collection - as it helps debugging.
</p>

<p>
This approach is not a magic bullet just as others such as OO and FP
aren't. A good engineer knows the right tool to use for the right
purpose. Don't shoot yourself in the foot with a magic bullet.
</p>

<p>
There was a lot of code in the presentation and it would be worth
going through it in some more detail if needed.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-01-23 Sat 14:44</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
